dev/singleBuilding/of7kEpsilon/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{

    inlet
    {
        type            VelocityABL;
        #include        "include/ABLConditions"
        value            $internalField;
    }

    outlet 
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    ground      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    building      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    #include "include/sideAndTopPatches"

}

// ************************************************************************* //
