dev/singleBuilding/of7kEpsilon/0/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

kappa               0.4;
Uref                6.73;
Zref                1.0;
zDir                (0 0 1);
flowDir             (1 0 0);
z0                  0.00075;

// Calculate ABL friction velocity U*
ustar               #calc "$Uref*$kappa / log(($Zref+$z0) / $z0)";


// ************************************************************************* //

// Curve-fitting coefficients for TKE profile

// A*log((z + z0)/z) + B*sqr((z + z0)/z0) + C(z + z0)/z0)+ D + E*log(z + z0)
// Note: If Zmax is large, code may fail due to negative value under sqrt

A               0;
B               0;
C               0;
D               0.52;     //C2 in Bellegoni
E               -0.04;    //C1 in Bellegoni

// // For Richards and Hoxey (1993) profiles: A=B=C=0; D=ustar^2/sqrt(Cmu)
// // For Parente et al 2011 profile:  A = A_parente; B=C=0; D=A_parente*ln(z0)+B_parente
// A             0;
// B                    0;
// C                    0;
// D                    #calc  "pow($ustar,2) / pow(0.09,0.5)"; // Richards Hoxey
// E                    0;

// Alternative TKE profile
BW              0;        // Flag for alternative TKE profile
hABL            1;        // TKE profile parameter, used when BW is selected

// ************************************************************************* //

// Blending coefficient
blendCoeff      1;      // Blending coefficient "alpha" in Eq.22 Bellegoni et al (2023).

// Upper limit turbulence model constants upper
CmuMax          0.35;     // Upper limit for Cmu (kEpsilon)
betaStarMax     0.35;     // Upper limit for betaStarMax (kOmegaSST)


// Turbulence model constants in distrubed region / wake field (WF)
// No effect when blendCoeff = 0
WFCmu           0.09;    // kEpsilon
WFbetaStar      0.09;    // kOmegaSST

// ************************************************************************* //

// Threshold/minimum deviation of U, k, epsilon, omega (%) to switch to detect distrubed region. Default values are fine.
// No effect when blendedCoeff = 0
thresholdU      0.05;
thresholdK      0.3;
thresholdE      0.1;
thresholdO      0.1;

// Attenuation parameters to avoid over-extending of disturbed region (Building Influence Area).
// =1/A in Eq. 23 of Bellegoni et al (2023)
// No effect when blendedCoeff = 0 
constantU       1;        // Au = 1
constantK       10;       // Ak = 0.1
constantE       10;       // Ae = 0.1
constantO       10;       // Ae = 0.1

// Method for detecting disturbed region 
// (1 0 0) : Detects based on deviation of U
// (0 1 0) : Detects based on deviation of K
// (0 1 0) : Detects based on deviation of max(U,k,epsilon/omega)
msel            (0 0 1);

