dev/singleBuilding/of7kEpsilon/0/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

flowVelocity         (5 0 0);
pressure             0;
turbulentKE          0.6;
turbulentEpsilon     1;
turbulentOmega       0.01;

// ************************************************************************* //
